# SQL Subqueries - Lab

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database Schema

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="images/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database **data.sqlite**.

In [1]:
import pandas as pd
import sqlite3

In [2]:
curr = sqlite3.connect('data.sqlite')
c = curr.cursor()

## Write an Equivalent Query using a Subquery

```SQL
select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';
```

In [12]:
df = pd.DataFrame(
    c.execute("""

select customerNumber, orderDate
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';

""").fetchall()
)
df.columns = [x[0] for x in c.description]
df

  customerNumber contactLastName contactFirstName
0            141      2003-01-31           Diego

In [13]:
df = pd.DataFrame(
    c.execute("""

SELECT customerNumber,
       contactLastName,
       contactFirstName
FROM customers
WHERE customerNumber in
    (
       SELECT customerNumber
       FROM orders 
       where orderDate = '2003-01-31'
)
;

""").fetchall()
)
df.columns = [x[0] for x in c.description]
df

  customerNumber contactLastName contactFirstName
0            141          Freyre           Diego

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [ ]:
df = pd.DataFrame(
    c.execute("""

SELECT productName,
       contactLastName,
       contactFirstName
FROM customers

WHERE productCode in
;

""").fetchall()
)
df.columns = [x[0] for x in c.description]
df

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

In [ ]:
#Your code here

## Select the Employee Number, Office Code, City (of the office), and Name (First and Last) of those Employees who Sold Products that Have Been Ordered by Less Then 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [ ]:
#Your code here

## Select the Employee Number, Name (First and Last) and Number of Customers of Employees Who's Customers Have an Average Credit Limit of Over 15K

In [14]:
#Your code here
df = pd.DataFrame(
    c.execute("""

SELECT employeeNumber, firstName, lastName
FROM employees
WHERE customerNumber in
    (
       SELECT customerNumber
       FROM orders 
       where orderDate = '2003-01-31'
)

;

""").fetchall()
)
df.columns = [x[0] for x in c.description]
df

   employeeNumber firstName   lastName
0            1002     Diane     Murphy
1            1056      Mary  Patterson
2            1076      Jeff   Firrelli
3            1088   William  Patterson
4            1102    Gerard     Bondur
5            1143   Anthony        Bow
6            1165    Leslie   Jennings
7            1166    Leslie   Thompson
8            1188     Julie   Firrelli
9            1216     Steve  Patterson
10           1286  Foon Yue      Tseng
11           1323    George     Vanauf
12           1337      Loui     Bondur
13           1370    Gerard  Hernandez
14           1401    Pamela   Castillo
15           1501     Larry       Bott
16           1504     Barry      Jones
17           1611      Andy     Fixter
18           1612     Peter      Marsh
19           1619       Tom       King
20           1621      Mami      Nishi
21           1625   Yoshimi       Kato
22           1702    Martin     Gerard

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!